// Returns MDAV scan type and when scan finished for each onboarded device
DeviceTvmInfoGathering
| extend ScanType = case(
    extractjson("$.Quick.ScanStatus", tostring(AdditionalFields.AvScanResults)) == "Completed", "Quick",
    extractjson("$.Full.ScanStatus", tostring(AdditionalFields.AvScanResults)) == "Completed", "Full",
    "Other")
| extend ScanTimestamp = case(
    extractjson("$.Quick.ScanStatus", tostring(AdditionalFields.AvScanResults)) == "Completed", extractjson("$.Quick.Timestamp", tostring(AdditionalFields.AvScanResults)),
    extractjson("$.Full.ScanStatus", tostring(AdditionalFields.AvScanResults)) == "Completed", extractjson("$.Full.Timestamp", tostring(AdditionalFields.AvScanResults)),
    "Other")
| project-away DeviceId, AdditionalFields
| sort by LastSeenTime desc
