//name: Defender for Antivirus (MDAV) Scan Status
//description:
//This query will provide a report with devices and their antivirus scan status, e.g. a full scan was completed, cancelled.
//This query can also be used to create a custom detection rule to create an informational alert when a manually triggered quick or full scan was completed.
//Colum StartedBy contains the following values:
//NETWORK SERVICE – Scheduled scan
//SYSTEM- Triggered manually via cloud, e.g. Intune
//USER – Triggered manually locally

DeviceEvents
| where ActionType has_any ("AntivirusScan", "AntivirusScanCompleted", "AntivirusScanCancelled")
| extend AdditionalFields = parse_json(AdditionalFields)
| extend ScanType = AdditionalFields.["ScanTypeIndex"], StartedBy= AdditionalFields.["User"]
| project Timestamp, DeviceId, ReportId, DeviceName, ActionType, ScanType, StartedBy
