//name: Controlled Folder Access Report
//description:
//This query will provide a report with all Controlled Folder Access actions that were audited or blocked.
//This query can also be used to create a custom detection rule that creates an informational alert when a Controlled Folder Access action was triggered.

DeviceEvents
| where ActionType has_any ('ControlledFolderAccessViolationAudited', 'ControlledFolderAccessViolationBlocked')
| project Timestamp, ReportId, DeviceId, DeviceName, ActionType, FolderPath, FileName, InitiatingProcessSHA1, InitiatingProcess = strcat(InitiatingProcessFolderPath, "\\" , InitiatingProcessFileName)
| sort by Timestamp desc 
