//name: Defender for Endpoint - Vulnerability Management - Browser Extensions Summary
//updated: 2025-2-27
//description:
//This query returns the browser extensions for each device including extension risk. You will need a Vulnerability Management license (add-on or standalone).
DeviceTvmBrowserExtensions
| join kind=inner (DeviceInfo | summarize arg_max(Timestamp, *) by DeviceId | project DeviceId, DeviceName, OSPlatform) on DeviceId
| summarize by DeviceName, OSPlatform, BrowserName, ExtensionId, ExtensionName, ExtensionVersion, ExtensionRisk

//In the backend, PowerShell script 'fc19515e-4fbb-46d1-b1f4-a28b394632fe.ps1' is collecting the data for browser extensions. You can check with the following query if and where the PS script ran.
DeviceEvents
| where InitiatingProcessCommandLine contains "fc19515e-4fbb-46d1-b1f4-a28b394632fe.ps1"
| summarize by Timestamp, DeviceName
