//name: Find WSL instances
//description:
//This first query will find all hosts where WSL is installed. The second query will find all devices where WSL was running as a process.

DeviceTvmSoftwareInventory
| where SoftwareName contains "windows_subsystem_for_linux"
| summarize Devices = makeset(DeviceName) by SoftwareName, SoftwareVersion
| project SoftwareName, SoftwareVersion, Devices


DeviceProcessEvents
| where FileName has_any ("wsl.exe", "wslhost.exe")
| project TimeGenerated, DeviceId, DeviceName, FileName, ProcessCommandLine, AccountDomain, AccountName
| sort by TimeGenerated desc
| distinct DeviceName
