//name: Get sensitive identities
//description:
//This query will find all identities that were tagged as sensitive by MDI/M365D.

IdentityInfo
| where Tags == "[\"Sensitive\"]"
| project AccountUpn, OnPremSid, AccountDisplayName, AccountName, AccountDomain, DistinguishedName, IsAccountEnabled, CreatedDateTime, SourceProvider, ChangeSource, AssignedRoles
